/*
 * cy8ctst242.c -- cy8ctst242 touch driver
 *
 * Copyright (C) 2012 Li Yang
 * All rights reserved.
 *
 */
#include "cy8ctst242.h"

extern struct tpd_device *tpd;
static struct task_struct *thread = NULL;
static DECLARE_WAIT_QUEUE_HEAD(waiter);
static struct early_suspend early_suspend;
#if 0
extern void mt65xx_eint_unmask(unsigned int line);
extern void mt65xx_eint_mask(unsigned int line);
extern void mt65xx_eint_set_hw_debounce(kal_uint8 eintno, kal_uint32 ms);
extern kal_uint32 mt65xx_eint_set_sens(kal_uint8 eintno, kal_bool sens);
extern void mt65xx_eint_set_polarity(unsigned int eint_num, unsigned int pol);
extern void mt65xx_eint_registration(kal_uint8 eintno, kal_bool Dbounce_En,
        kal_bool ACT_Polarity, void (EINT_FUNC_PTR)(void),
        kal_bool auto_umask);
#endif
static void tpd_eint_interrupt_handler(void);

static int __devinit tpd_probe(struct i2c_client *client, const struct i2c_device_id *id);
static int tpd_detect(struct i2c_client *client, int kind, struct i2c_board_info *info);
static int __devexit tpd_remove(struct i2c_client *client);
static int touch_event_handler(void *unused);
int g_bcy8stmstar = true;
//#define CY8CTST_BOOTLOADER
#define CY8CTST_SENSOR
//#define CY8CTST_DEBUG
#define GET_HSTMODE(reg)  ((reg & 0x70) >> 4)  // in op mode or not 
#define GET_BOOTLOADERMODE(reg) ((reg & 0x10) >> 4)  // in bl mode 
#define CY8CTST_VENDOR_REG 		0x10
#define CY8CTST_FW_REG 			0x11
#define CY8CTST_SENSOR_EN_REG 	0x12
#define CY8CTST_SENSOR_STATE_REG 	0x13
static int tpd_flag = 0;
static int boot_mode;
static int binit = 0;
extern int updating;

struct i2c_client_ctxt{
	 struct i2c_client *client;
	 struct mutex lock;
	 struct mutex power_lock;
};

static struct i2c_client_ctxt *_cy8ctst_client;

static uint8_t bootloader_exit_cmd[] = {
	0x00, 0x00, 0xFF, 0xA5, 
	0x00, 0x01, 0x02, 0x03, 
	0x04, 0x05, 0x06, 0x07
};

struct tpd_operation_data_t{
	uint8_t hst_mode; //0x00
	uint8_t tt_mode;
	uint8_t tt_stat;
	uint8_t x1_H;
	uint8_t x1_L;
	uint8_t y1_H;
	uint8_t y1_L;
	uint8_t z1;
	uint8_t touch12_id; //0x08
	uint8_t x2_H;
	uint8_t x2_L;
	uint8_t y2_H;
	uint8_t y2_L;
	uint8_t z2;
	uint8_t gest_cnt;
	uint8_t gest_id;
	uint8_t gest_set; //0x10
	uint8_t res1;
	uint8_t sensor_en; //0x12
	uint8_t sensor_state; //0x13
#ifdef CY8CTST_DEBUG
	uint8_t diff_L; //0x14
	uint8_t diff_H;
	uint8_t rawdata_L; //0x16
	uint8_t rawdata_H;
	uint8_t baseline_L; //0x18
	uint8_t baseline_H;
#endif
};

struct tpd_bootloader_data_t{
    uint8_t bl_file;
    uint8_t bl_status;
    uint8_t bl_error;
    uint8_t blver_hi,blver_lo;
    uint8_t bld_blver_hi,bld_blver_lo;

    uint8_t ttspver_hi,ttspver_lo;
    uint8_t appid_hi,appid_lo;
    uint8_t appver_hi,appver_lo;

    uint8_t cid_0;
    uint8_t cid_1;
    uint8_t cid_2;

};

struct tpd_sysinfo_data_t{
    uint8_t   hst_mode;
    uint8_t  mfg_cmd;
    uint8_t  mfg_stat;
    uint8_t cid[3];
    uint8_t tt_undef1;

    uint8_t uid[8];
    uint8_t  bl_verh;
    uint8_t  bl_verl;

    uint8_t tts_verh;
    uint8_t tts_verl;

    uint8_t app_idh;
    uint8_t app_idl;
    uint8_t app_verh;
    uint8_t app_verl;

    uint8_t tt_undef2[6];
    uint8_t  act_intrvl;
    uint8_t  tch_tmout;
    uint8_t  lp_intrvl;	 

};

struct touch_info {
    int x1, y1;
    int x2, y2;
    int p1, p2;
    int id1,id2;
    int count;
};

struct id_info{
    int pid1;
    int pid2;
    int reportid1;
